Revit 2025 API
ControlledApplication.DocumentReloadingLatest Event
 Subscribe to the DocumentReloadingLatestEventArgs event to be notified when Revit is just about to reload latest changes from a central model.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public event EventHandler<DocumentReloadingLatestEventArgs> DocumentReloadingLatest
Public Event DocumentReloadingLatest As EventHandler(Of DocumentReloadingLatestEventArgs)
public:
 event EventHandler<DocumentReloadingLatestEventArgs^>^ DocumentReloadingLatest {
	void add (EventHandler<DocumentReloadingLatestEventArgs^>^ value);
	void remove (EventHandler<DocumentReloadingLatestEventArgs^>^ value);
}
member DocumentReloadingLatest : IEvent<EventHandler<DocumentReloadingLatestEventArgs>,
    DocumentReloadingLatestEventArgs>
Value
EventHandler<DocumentReloadingLatestEventArgs>
Remarks
This event is raised when Revit is just about to reload latest changes from a central model.
 Handlers of this event are permitted to make modifications to any document (including the active document), except for documents that are currently in read-only mode.
Event is cancellable. To cancel it, call the 'Cancel()' method in event's argument to True. Your application is responsible for providing feedback to the user about the reason for the cancellation.
The following API functions are not available for the current document during this event:
[!:Autodesk::Revit::DB::Document::Close()] and similar overloads.
[!:Autodesk::Revit::DB::Document::Save()] .
[!:Autodesk::Revit::DB::Document::SaveAs(String)] and similar overloads.
Exception InvalidOperationException will be thrown if any of the above methods is called during this event.
Another DocumentReloadingLatest event will be raised immediately after latest changes reloading from a central model is finished.
See Also
Reference
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace